package Ch04;

public class Ch04변수자료형 {

	public static void main(String[] args) {
		//-------------------------------
		//정수 int-4byte 정수
		//-------------------------------
//		int n1 = 0b10101101; //2진수
//		int n2 = 173;        //10진정수값
//		int n3 = 0255;       //8진수
//		int n4 = 0xad;       //16진수
//		System.out.printf("%d %d %d %d\n", n1,n2,n3,n4);
		
		//-------------------------------
		//정수 byte-=1byte 정수 부호 O
		//-------------------------------
//		byte n1 = -128;
//		byte n2 = -30;
//		byte n3 = 30;
//		byte n4 = 127;
//		byte n5 = 128; //문제 발생 Why? 
//		byte n5 = (byte)128; //1byte는 -128~0~127까지라 byte필요 
//		System.out.printf("%d\n",n5); // -128로 출력 Why? 
		
		//-------------------------------
		//정수 short-2byte 정수 부호 O | char-2byte정수 부호x(양수만)
		//-------------------------------
//		char n1 = 65535;  //(0~2^16-1) (0~65535)
//		short n2 = 32767; // (-2^15 ~ +2^15-1)(-32768 ~ +32767)
//		
//		char n3=60000;
//		//short n4 = n3; //문제발생 Why?
//		short n4 = (short)n3; //d
//		
//		System.out.printf("%d\n",n4);
		
		//-------------------------------
		//정수 long-8byte 정수 부호 O
		//-------------------------------
//		long n1 = 10;
//		long n2 = 20L; // L,l (리터럴접미사) : long자료형사용하여 값 저장
//		
//		long n3 = 10000000000; 문제발생 Why?
//		long n4 = 10000000000L;
		
		//-------------------------------
		//실수
		//-------------------------------
		//유리수와 무리수의 통칭
		//소숫점 이하값을 가지는 수 
		//float : 4byte 실수 (6~9자리)
		//double : 8byte 실수 (15~18자리)
		
		//정밀도 확인
		//float n1 = 0.123456789;  왼쪽 float = 오른쪽 double 다르기 때문에 오류 f,F접미사 필요
//		float n1 = 0.123456789F;
//		double n2 = 0.123456789123456789;
//		
//		System.out.println(n1);
//		System.out.println(n2);
		
		//-------------------------------
		//단일문자 char
		//-------------------------------
		
		
		

	}

}
